# Описание решения
**Задача**

Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

*Примеры:*

1. ["hello", "2", "world", ":-)"] -> ["2", ":-)"]
2. ["1234", "1567", "-2", "computer science"] -> ["-2"]
3. ["Russia", "Denmark", "Kazan"] -> []


## Решение

+ ### Ввод и вывод первоначального массива

Сначала мы объявляем массив **string[] array**, 
который заполняем вводом с клавиатуры. Далее, мы выводим первоначальный массив на экран.
```
string[] array;
Console.WriteLine("Введите массив строк через запятую (без пробела)");
string elementOfArray = Console.ReadLine();
array = elementOfArray.Split(',');
```
Выводим первоначальным массив на экран:
```
for (int i = 0; i < array.Length; i++)
    Console.Write($"{array[i]}, ");
```

+ ### Поиск строк в массиве, где число элементов <= 3

Создаем метод **ArrayCheck**, который ищет строки в массиве, где количество элементов <= 3.

```
...
int ArrayCheck(string[] array)
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {                                          
        if (array[i].Length <= 3) count++;
    }
    return count;
}
...
```
Потом записываем результат метода в переменную **Count**

+ ### Заполняем массив строками, удовлетворяющими условию

Создаём метод **string[] FillResultArray**, где на выходе возвращаем массив, заполненный строками, удовлетворяющими условию <= 3 символа.
```
...
string[] FillResultArray(string[] array, int count)
{
    string[] result = new string[count];
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3)
        {
            result[result.Length - count] = array[i];
            count--;
        }
    }
    return result;
}
...
```
+ ### Выводим результирующий массив на экран
Создаем метод **PrintArray**, который выводит результирующий массив.
```
...
void PrintArray(string[] array)
{
    Console.WriteLine();
    for (int i = 0; i < array.Length - 1; i++) Console.Write($"{array[i]}, ");
    Console.Write($"{array[array.Length - 1]}");
}
...
```
Выводим результирующий массив на экран:
```
...
Console.Write(" ->");       // Для красоты :-)
PrintArray(resultArray);
```

## Результат
В результате выполнения команды, в консоль выведется первоначальный и результирующий массивы:
```
hello, 2, world, :-), 1234, 1567, -2, Russia, Denmark, Kazan,  ->
2, :-), -2
```